import React from 'react'

export const PokemonInfoItem = ({ info }) => {
    return (
        <div className="pokemon__accurate-info">
            <h2>Внешность</h2>
            <p>
                Бульбазавр — маленький четвероногий покемон голубовато-зелёного цвета с темно-зелёными пятнами на теле. У него красные глаза, широкий рот и слегка заострённые уши. Когда его рот открыт, на его верхней челюсти видна пара заострённых зубов. У него толстые лапы, заканчивающиеся тремя острыми когтями. На спине у Бульбазавра находится зелёная луковица, которая, согласно записи в Покедексе, была посажена там при рождении. Когда Бульбазавр готов эволюционировать, луковица на его спине начинает мерцать голубоватым цветом и впоследствии преобразуется в бутон. Если он не хочет развиваться, он изо всех сил сопротивляется трансформации.
            </p>
        </div>
    )
}
